tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    chemistrySolver   ode;
    chemistryThermo   psi;
}

chemistry       on;

initialChemicalTimeStep 1e-07;

EulerImplicitCoeffs
{
    cTauChem        0.05;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          seulex;
    eps             0.05;
}


// ************************************************************************* //
