tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solverFreq      1;

radiationModel  P1;

P1Coeffs
{
    C               C [0 0 0 0 0 0 0] 0;
}

absorptionEmissionModel binaryAbsorptionEmission;

binaryAbsorptionEmissionCoeffs
{
    model1
    {
        absorptionEmissionModel constantAbsorptionEmission;
        constantAbsorptionEmissionCoeffs
        {
            absorptivity    absorptivity    [0 -1 0 0 0 0 0] 0.5;
            emissivity      emissivity      [0 -1 0 0 0 0 0] 0.5;
            E               E   [1 -1 -3 0 0 0 0] 0;
        }
    }
    model2
    {
        absorptionEmissionModel cloudAbsorptionEmission;
        cloudAbsorptionEmissionCoeffs
        {
            cloudNames
            (
                coalCloud1
                limestoneCloud1
            );
        }
    }
}

scatterModel    cloudScatter;

cloudScatterCoeffs
{
    cloudNames
    (
        coalCloud1
        limestoneCloud1
    );
}

transmissivityModel none;

// ************************************************************************* //
